Revit 2026 API

# KeyBasedTreeEntriesIteratorCurrent Property

---

Gets the item at the current position of the iterator.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual KeyBasedTreeEntry Current { get; }
```
```vb
Public Overridable ReadOnly Property Current As KeyBasedTreeEntry
	Get
```
```cpp
public:
virtual property KeyBasedTreeEntry^ Current {
	KeyBasedTreeEntry^ get ();
}
```
```fsharp
abstract Current : KeyBasedTreeEntry with get
override Current : KeyBasedTreeEntry with get
```

#### Property Value

KeyBasedTreeEntry

#### Implements

IEnumeratorTCurrent

| Exception | Condition |
| --- | --- |
| InvalidOperationException | There is no current item in the iterator. |

There is no current item if the iterator has not started yet or has been done.

#### Reference

KeyBasedTreeEntriesIterator Class

Autodesk.Revit.DB Namespace